grevaillot/svd_tools/headers/STM32L4R7/gpiod.h
#pragma once 

/* --- GPIOD: General-purpose I/Os ---------------------------------- */

/** @defgroup gpiod_registers General-purpose I/Os Register
@{*/

/** GPIOD_MODER GPIO port mode register **/
#define GPIOD_MODER			MMIO32(GPIOD_BASE + 0x00)
/** GPIOD_OTYPER GPIO port output type register **/
#define GPIOD_OTYPER			MMIO32(GPIOD_BASE + 0x04)
/** GPIOD_OSPEEDR GPIO port output speed register **/
#define GPIOD_OSPEEDR			MMIO32(GPIOD_BASE + 0x08)
/** GPIOD_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOD_PUPDR			MMIO32(GPIOD_BASE + 0x0c)
/** GPIOD_IDR GPIO port input data register **/
#define GPIOD_IDR			MMIO32(GPIOD_BASE + 0x10)
/** GPIOD_ODR GPIO port output data register **/
#define GPIOD_ODR			MMIO32(GPIOD_BASE + 0x14)
/** GPIOD_BSRR GPIO port bit set/reset register **/
#define GPIOD_BSRR			MMIO32(GPIOD_BASE + 0x18)
/** GPIOD_LCKR GPIO port configuration lock register **/
#define GPIOD_LCKR			MMIO32(GPIOD_BASE + 0x1c)
/** GPIOD_AFRL GPIO alternate function low register **/
#define GPIOD_AFRL			MMIO32(GPIOD_BASE + 0x20)
/** GPIOD_AFRH GPIO alternate function high register **/
#define GPIOD_AFRH			MMIO32(GPIOD_BASE + 0x24)
/** GPIOD_BRR GPIO port bit reset register **/
#define GPIOD_BRR			MMIO32(GPIOD_BASE + 0x28)
/** GPIOD_ASCR GPIO port analog switch control register **/
#define GPIOD_ASCR			MMIO32(GPIOD_BASE + 0x2c)

/**@}*/


/** @defgroup gpiod_moder MODER GPIO port mode register
@{*/


#define GPIOD_MODER_MODER15_SHIFT		30
#define GPIOD_MODER_MODER15_MASK		0x03
/** @defgroup gpiod_moder_moder15 MODER15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER14_SHIFT		28
#define GPIOD_MODER_MODER14_MASK		0x03
/** @defgroup gpiod_moder_moder14 MODER14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER13_SHIFT		26
#define GPIOD_MODER_MODER13_MASK		0x03
/** @defgroup gpiod_moder_moder13 MODER13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER12_SHIFT		24
#define GPIOD_MODER_MODER12_MASK		0x03
/** @defgroup gpiod_moder_moder12 MODER12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER11_SHIFT		22
#define GPIOD_MODER_MODER11_MASK		0x03
/** @defgroup gpiod_moder_moder11 MODER11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER10_SHIFT		20
#define GPIOD_MODER_MODER10_MASK		0x03
/** @defgroup gpiod_moder_moder10 MODER10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER9_SHIFT		18
#define GPIOD_MODER_MODER9_MASK		0x03
/** @defgroup gpiod_moder_moder9 MODER9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER8_SHIFT		16
#define GPIOD_MODER_MODER8_MASK		0x03
/** @defgroup gpiod_moder_moder8 MODER8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER7_SHIFT		14
#define GPIOD_MODER_MODER7_MASK		0x03
/** @defgroup gpiod_moder_moder7 MODER7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER6_SHIFT		12
#define GPIOD_MODER_MODER6_MASK		0x03
/** @defgroup gpiod_moder_moder6 MODER6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER5_SHIFT		10
#define GPIOD_MODER_MODER5_MASK		0x03
/** @defgroup gpiod_moder_moder5 MODER5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER4_SHIFT		8
#define GPIOD_MODER_MODER4_MASK		0x03
/** @defgroup gpiod_moder_moder4 MODER4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER3_SHIFT		6
#define GPIOD_MODER_MODER3_MASK		0x03
/** @defgroup gpiod_moder_moder3 MODER3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER2_SHIFT		4
#define GPIOD_MODER_MODER2_MASK		0x03
/** @defgroup gpiod_moder_moder2 MODER2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER1_SHIFT		2
#define GPIOD_MODER_MODER1_MASK		0x03
/** @defgroup gpiod_moder_moder1 MODER1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_MODER_MODER0_SHIFT		0
#define GPIOD_MODER_MODER0_MASK		0x03
/** @defgroup gpiod_moder_moder0 MODER0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiod_otyper OTYPER GPIO port output type register
@{*/

/** GPIOD_OTYPER_OT15 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT15		(1 << 15)
/** GPIOD_OTYPER_OT14 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT14		(1 << 14)
/** GPIOD_OTYPER_OT13 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT13		(1 << 13)
/** GPIOD_OTYPER_OT12 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT12		(1 << 12)
/** GPIOD_OTYPER_OT11 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT11		(1 << 11)
/** GPIOD_OTYPER_OT10 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT10		(1 << 10)
/** GPIOD_OTYPER_OT9 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT9		(1 << 9)
/** GPIOD_OTYPER_OT8 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT8		(1 << 8)
/** GPIOD_OTYPER_OT7 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT7		(1 << 7)
/** GPIOD_OTYPER_OT6 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT6		(1 << 6)
/** GPIOD_OTYPER_OT5 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT5		(1 << 5)
/** GPIOD_OTYPER_OT4 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT4		(1 << 4)
/** GPIOD_OTYPER_OT3 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT3		(1 << 3)
/** GPIOD_OTYPER_OT2 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT2		(1 << 2)
/** GPIOD_OTYPER_OT1 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT1		(1 << 1)
/** GPIOD_OTYPER_OT0 Port x configuration bits (y = 0..15) **/
#define GPIOD_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpiod_ospeedr OSPEEDR GPIO port output speed register
@{*/


#define GPIOD_OSPEEDR_OSPEEDR15_SHIFT		30
#define GPIOD_OSPEEDR_OSPEEDR15_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr15 OSPEEDR15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR14_SHIFT		28
#define GPIOD_OSPEEDR_OSPEEDR14_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr14 OSPEEDR14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR13_SHIFT		26
#define GPIOD_OSPEEDR_OSPEEDR13_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr13 OSPEEDR13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR12_SHIFT		24
#define GPIOD_OSPEEDR_OSPEEDR12_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr12 OSPEEDR12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR11_SHIFT		22
#define GPIOD_OSPEEDR_OSPEEDR11_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr11 OSPEEDR11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR10_SHIFT		20
#define GPIOD_OSPEEDR_OSPEEDR10_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr10 OSPEEDR10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOD_OSPEEDR_OSPEEDR9_SHIFT		18
#define GPIOD_OSPEEDR_OSPEEDR9_MASK		0x03
/** @defgroup gpiod_ospeedr_ospeedr9 OSPEEDR9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


